Autodesk.Revit.DB.Analysis.AnalysisResultSchema.SetUnits(System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.Double})
Sets names and multipliers of all units for result visualization
names:
Unit names for all units (e.g., "Lb" and "Kg")
multipliers:
Numerical coefficients mapped to unit names.
They adjust measurement values shown in the legend and display (e.g., 1.0 and 0.451 - if actual measurements are in Lb)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
names is zero-length or contains duplicate or empty names
-or-
multipliers contains non-positive numbers, or its length is not equal to the length of names
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
Determines if the input object is equivalent to this AnalysisResultSchema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.AnalysisDisplayStyleId
ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Description
Description of analysis result in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Name
Name of analysis result in view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor(System.String,System.String)
Creates object and assigns name and description
name:
Name of the result schema
description:
Description of the result schema
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
Constructs a new copy of the input AnalysisResultSchema object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012